Documents/омг_СпискиУслугДляРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>омг_СпискиУслугДляРасчетаЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.омг_НоменклатураИзСписковДляЗарплаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПодробно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходнаяУслугаГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УниверсальныйСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/омг_СпискиУслугДляРасчетаЗарплаты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтараяТаблицаУслуг = ЭтотОбъект.УслугиПодробно.Выгрузить();
	
	ТабУслуги = ЭтотОбъект.Услуги.Выгрузить();
	ТабУслуги.Свернуть("Услуга");
	
	УслугиПодробно.Очистить();
	
	Если ТабУслуги.Количество() > 0 Тогда
		
		МассивНоменклатуры = ТабУслуги.ВыгрузитьКолонку("Услуга");
		СоответствиеЭтоГруппа = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивНоменклатуры, "ЭтоГруппа");
		
		МассивГрупп = Новый Массив;
		МассивУслуг = Новый Массив;
		
		Для Каждого Строка Из ТабУслуги Цикл
			Если СоответствиеЭтоГруппа.Получить(Строка.Услуга).ЭтоГруппа Тогда
				МассивГрупп.Добавить(Строка.Услуга);
			Иначе
				МассивУслуг.Добавить(Строка.Услуга);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Услуга Из МассивУслуг Цикл
			СтрУслугиПодробно = УслугиПодробно.Добавить();
			СтрУслугиПодробно.Услуга    = Услуга;
			СтрУслугиПодробно.Приоритет = 1;
		КонецЦикла;
		
		Если МассивГрупп.Количество() > 0 Тогда
			
			УслугиИзГрупп = омг_ДополнительныеАлгоритмы.ВернутьСписокУслугСприоритетом(МассивГрупп);
			
			Для Каждого Строка Из УслугиИзГрупп Цикл
				СтрУслугиПодробно = УслугиПодробно.Добавить();
				СтрУслугиПодробно.Услуга               = Строка.Услуга;
				СтрУслугиПодробно.Приоритет            = Строка.Приоритет;
				СтрУслугиПодробно.ИсходнаяУслугаГруппа = Строка.ИсходнаяУслугаГруппа;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Дифф = омг_ДополнительныеАлгоритмы.ВычислитьДиффУслуг(СтараяТаблицаУслуг, УслугиПодробно.Выгрузить());
	
	ЗатронутыеУслуги = Новый Массив;
	Для Каждого Элемент Из Дифф.Удаленные Цикл
		ЗатронутыеУслуги.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из Дифф.Добавленные Цикл
		ЗатронутыеУслуги.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из Дифф.Измененные Цикл
		ЗатронутыеУслуги.Добавить(Элемент);
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("омг_ЗатронутыеУслуги", ЗатронутыеУслуги);

КонецПроцедуры
